using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace pokemmoHelper
{
    class Moves
    {
        public static List<string> AllUsualMovesName = new List<string>() {"火焰拳", "雷电拳","冰冻拳","剑舞","吹飞","飞踢","泰山压顶","大闹一番","舍身冲撞","吼叫","喷射火焰","水炮","冲浪",
            "冰冻光束","暴风雪","破坏光线","啄钻","踢倒","双倍奉还","地球上投","寄生种子","生长","日光束","毒粉","麻痹粉","催眠粉","花瓣舞","火焰漩涡","十万伏特","电磁波","打雷","地震","剧毒",
            "精神强念","催眠术","电光一闪","黑夜魔影","自我再生","光墙","黑雾","反射壁","聚气","高速移动","自爆","大字爆炎","攀瀑","瞬间失忆","生蛋","飞膝踢","溶化","骨头回力镖","岩崩","三重攻击",
            "大蛇瞪眼","吸血","蘑菇孢子","大爆炸","睡觉","愤怒门牙","替身","小偷","诅咒","守住","腹鼓","撒菱","同命","冰冻之风","终极吸取","蛛网","起死回生","音速拳","污泥炸弹","电磁炮","灭亡之歌",
            "看穿","虚张声势","黑色目光","梦话","治愈铃声","报恩","分担痛楚","爆裂拳","超级角击","再来一次","追打","高速旋转","晨光","光合作用","月光","觉醒力量","十字劈","求雨","大晴天","咬碎",
            "镜面反射","神速","原始之力","暗影球","预知未来","潮旋","围攻","击掌奇袭","热风","鬼火","临别礼物","硬撑","真气拳","挑衅","戏法","祈愿","蛮力","劈瓦","哈欠","拍落","蛮干","喷火","抢夺",
            "羽毛舞","火焰踢","偷懒","巨声","彗星拳","芳香治疗","过热","岩石封锁","宇宙力量","喷水","信号光束","神通力","冲天拳","流沙地狱","种子机关枪","燕返","冰锥","铁壁","挡路","龙爪","健美",
            "弹跳","渴望","伏特攻击","冥想","叶刃","龙之舞","岩石爆击","羽栖","臂锤","陀螺球","顺风","点穴","金属爆炸","急速折返","近身战","以牙还牙","精神转移","回复封锁","突袭","珍藏","毒菱",
            "闪焰冲锋","波导弹","岩石打磨","毒击","恶之波动","暗袭要害","水流尾","种子炸弹","空气斩","十字剪","虫鸣","龙之波动","龙之俯冲","力量宝石","吸取拳","真空波","真气弹","能量球","勇鸟猛攻",
            "大地之力","掉包","终极冲击","诡计","子弹拳","雪崩","冰砾","暗影爪","雷电牙","火焰牙","冰冻牙","影子偷袭","精神利刃","意念头锤","加农光炮","清除浓雾","戏法空间","流星群","放电","喷烟",
            "飞叶风暴","强力鞭打","十字毒刃","垃圾射击","铁头","尖石攻击","隐形岩","打草结","木槌","水流喷射","双刃头锤","磨爪","污泥波","蝶舞","重磅冲撞","蓄能焰袭","浸水","盘蜷","酸液炸弹",
            "欺诈","清除之烟","热水","破壳","祸不单行","巴投","杂技","搏命","伏特替换","龙尾","疯狂伏特","木角","棉花防守","暗黑爆破","高温重压","暴风","爆炸头突击","火之舞","齿轮飞盘","大声咆哮","喝牛奶" };
    }
}
